fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_ПлановыеОтпуски</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ОтпускаСотрудников</name>
    <attributes>
      <name>ВКМ_Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудник</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/InformationRegisters/ВКМ_ПлановыеОтпуски/ВКМ_ПлановыеОтпуски.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ПлановыеОтпуски</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудник</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ,Режим)
Ошиб = "";
	// регистр ВКМ_ПлановыеОтпуски
	Движения.ВКМ_ПлановыеОтпуски.Записывать = Истина;
	
	Для Каждого ТекСтрокаВКМ_ОтпускаСотрудников из ВКМ_ОтпускаСотрудников Цикл
		Если не ЗначениеЗаполнено(ТекСтрокаВКМ_ОтпускаСотрудников.ВКМ_ДатаНачала) Тогда
			 Ошиб = СтрШаблон("%1%2У Сотрудника %3 не заполнена дата начала отпуска.",Ошиб,Символы.ПС, Строка(ТекСтрокаВКМ_ОтпускаСотрудников.ВКМ_Сотрудник));
		КонецЕсли;		
		Если не ЗначениеЗаполнено(ТекСтрокаВКМ_ОтпускаСотрудников.ВКМ_ДатаОкончания) Тогда
			 Ошиб = СтрШаблон("%1%2У Сотрудника %1 не заполнена дата конца отпуска.",Ошиб,Символы.ПС,  Строка(ТекСтрокаВКМ_ОтпускаСотрудников.ВКМ_Сотрудник));
		КонецЕсли;		
		Если ТекСтрокаВКМ_ОтпускаСотрудников.ВКМ_ДатаНачала> ТекСтрокаВКМ_ОтпускаСотрудников.ВКМ_ДатаОкончания Тогда
			 Ошиб = СтрШаблон("%1%2У Сотрудника %1 не заполнена дата начала отпуска больше даты конца.",Ошиб,Символы.ПС,  Строка(ТекСтрокаВКМ_ОтпускаСотрудников.ВКМ_Сотрудник));
		КонецЕсли;		
		
		Если ЗначениеЗаполнено(Ошиб) Тогда
			Продолжить;
		КонецЕсли;

		ДатаТек = ТекСтрокаВКМ_ОтпускаСотрудников.ВКМ_ДатаНачала;
		Пока ДатаТек<= ТекСтрокаВКМ_ОтпускаСотрудников.ВКМ_ДатаОкончания Цикл
			Движение = Движения.ВКМ_ПлановыеОтпуски.Добавить();
			Движение.ВКМ_Дата = ДатаТек;
			Движение.ВКМ_Сотрудник = ТекСтрокаВКМ_ОтпускаСотрудников.ВКМ_Сотрудник;
			Движение.Значение = 1;
			ДатаТек = ДатаТек + 1*24*60*60;
		КонецЦикла;
	КонецЦикла;
	
		Если ЗначениеЗаполнено(Ошиб) Тогда
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю(Ошиб);
		КонецЕсли;
	
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
#КонецОбласти
#КонецЕсли
